# Створіть два файли в 1-му напишіть такі функції:
# 1) сортування списка по зростанню числа, від меншого до більшого. Функція приймає список з чисел і повертає
# відсортований список.
# 2) сортування списка на спад, від  більшого до меншого. Функція приймає список з чисел і повертає відсортований список.
# 3) сортування за кількістю букв у слові. Функція приймає список з слів і повертає відсортований список.
# 2-ий файл з трьома тестами який буде тестити ці три функції. В кожному тесті 1 тест.
# В тестових функціях ми ставимо типізацію. В першому файлі в всіх функціях проставляємо що приймає і що повертає.
# Встановіть собі пайтест і прораньте. До домашки отрім кода додайте скріншот прогона тестів.


# 1) сортування списка по зростанню числа, від меншого до більшого. Функція приймає список з чисел і повертає
# відсортований список.
# Функція приймає список чисел і сортує їх
def sorting_list_of_numbers(*args):
    # Сортувати числа
    sorted_numbers = sorted(args)
    return sorted_numbers

# Отримання чисел від користувача.
sorting_list_of_numbers_input = input("Введіть числа, розділені пробілами: ")
# Розділити рядок на числа за пробілами та перетворити їх у числа
numbers = [int(float(num)) for num in sorting_list_of_numbers_input.split()]
sorted_numbers = sorting_list_of_numbers(*numbers)
print(sorted_numbers)


# 2) сортування списка на спад, від  більшого до меншого. Функція приймає список з чисел і повертає відсортований список.
def sorting_list_descending(*args):
    return sorted(args, reverse=True)

# Отримання чисел від користувача.
sorting_list_input = input("Введіть числа, розділені пробілами: ")
numbers_1 = [float(num) for num in sorting_list_input.split()]
sorted_descending_numbers = sorting_list_descending(*numbers)
print(sorted_descending_numbers)


# 3) сортування за кількістю букв у слові. Функція приймає список з слів і повертає відсортований список.
# Функція приймає слова і сортує їх за кількістю букв
def sorting_list_of_words(*args):
    # Сортувати слова за довжиною
    sorted_words = sorted(args, key=len)
    return sorted_words

# Отримання слів від користувача.
sorting_list_of_words_input = input("Введіть слова, розділені пробілами: ").split()
sorted_words = sorting_list_of_words(*sorting_list_of_words_input)
print(sorted_words)
