# Задача 1
#
# Уявимо що до нас прийшов наш друг або подруга і попросили написати додаток для покупок в магазині
# що б можна було скласти список продуктів та коли купуєш викреслювати(для викреслення питайте номер елемента,
# # що б видалити по індексу треба його передати
# # в pop list_a.pop(0) - видалить нульовий індекс, памятайте що користувач не знає що в нас індекси починаються з нуля)
# # Також нам відомо що цей список має пять або більше елементів.
# # Після кожного видалення елементу виводьте наш оновлений список.
# # Після 5 видалень перевірте чи список пустий якщо не пустий напишіть що ось ще є продукти, якщо пусти то напишіть про це.
# # Також після цього кроку запропонуйте користувачу написати ще продуктів та додати його в кошик.
# # і виведіть їх на екран. Але цього разу вже без видалень.
# # кроки:
# # Спочатку пропонуємо користувачу ввести продукти.
# # Робимо 5 запитів на видалення
# # Перевіряємо корзину
# # Пропонуємо додати продукти
# # Виводмо список і прощаємось
# list_a = input("Введіть список продуктів: ")
# list_a = list_a.split()
# print(type(list_a))
# list_a.pop()
# print(list_a)
# list_a.pop()
# print(list_a)
# list_a.pop()
# print(list_a)
# list_a.pop()
# print(list_a)
# list_a.pop()
# print(list_a)
# if len(list_a) == 0:
#     print("У корзині порожньо")
# else:
#     print("У корзині ще лишились товари", list_a)
# list_a.append(input("Додайте в список: "))
# print("У корзині добавилося: ", list_a)