# home_work_7.py
# Створіть два файли в 1-му напишіть такі функції:
# 1) сортування списка по зростанню числа, від меншого до більшого. Функція приймає список з чисел і повертає
# відсортований список.
# 2) сортування списка на спад, від  більшого до меншого. Функція приймає список з чисел і повертає відсортований список.
# 3) сортування за кількістю букв у слові. Функція приймає список з слів і повертає відсортований список.
# 2-ий файл з трьома тестами який буде тестити ці три функції. В кожному тесті 1 тест.
# В тестових функціях ми ставимо типізацію. В першому файлі в всіх функціях проставляємо що приймає і що повертає.
# Встановіть собі пайтест і прораньте. До домашки отрім кода додайте скріншот прогона тестів.


# 1) сортування списка по зростанню числа, від меншого до більшого. Функція приймає список з чисел і повертає
# відсортований список.

# Функція sorting_list_of_numbers, яка приймає список чисел
def sorting_list_of_numbers(*args: int):
    # Сортувати числа
    sorted_numbers = sorted(args)
    return sorted_numbers

# Введення чисел прямо в коді
numbers_to_sort = [8, 1, 4, 2, 5, 9, 3, 6, 7]

# Виклик функції та виведення відсортованого списку
sorted_numbers = sorting_list_of_numbers(*numbers_to_sort)
print(sorted_numbers)



# # 2) сортування списка на спад, від  більшого до меншого. Функція приймає список з чисел і повертає відсортований список.
# Функція sorting_list_descending, яка приймає список чисел
def sorting_list_descending(*args: int):
    return sorted(args, reverse=True)

# Введення чисел прямо в коді
numbers_to_sort_1 = [8, 1, 4, 2, 5, 9, 3, 6, 7]

# Виклик функції та виведення відсортованого списку
sorted_descending_numbers = sorting_list_descending(*numbers_to_sort_1)
print(sorted_descending_numbers)



# # 3) сортування за кількістю букв у слові. Функція приймає список з слів і повертає відсортований список.
# Функція приймає слова і сортує їх за кількістю букв
def sorting_list_of_words(*args: str):
    sorted_words = sorted(args, key=len)
    return sorted_words

 # Введення слів прямо в коді
input_words = ["apple", "pineapple", "kiwi", "orange", "plum"]

# Виклик функції та виведення відсортованого списку
sorted_words = sorting_list_of_words(*input_words)
print(sorted_words)
